app/views/tweets/index.html.erb

    <% @users.each do |u| %>
        <% u.tweets.each do |t| %>
---
SELECT `tweets`.* FROM `tweets`