app/views/tweets/show.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 20
---
        <%end%>
        <p>いいね件数: <%= @tweet.likes.count %></p>