app/views/users/show.html.erb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 1
---
    <div class="mytweets">
        <% @user.tweets.each do |t| %>