app/controllers/likes_controller.rb

    def create
        @like = current_user.likes.create(tweet_id: params[:tweet_id])
---
INSERT INTO `likes` (`tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES (7, 1, '2020-08-11 07:38:17.565362', '2020-08-11 07:38:17.565362')

    def destroy
        @like = Like.find_by(tweet_id: params[:tweet_id],user_id: current_user.id)
        @like.destroy
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`tweet_id` = 7 AND `likes`.`user_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1