app/controllers/tweets_controller.rb

    def index
       @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets`

    def update
        @tweet = Tweet.find(params[:id])

        if @tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 20 LIMIT 1
UPDATE `tweets` SET `tweets`.`image` = 'monndai.pdf', `tweets`.`updated_at` = '2020-09-04 13:06:38.852340' WHERE `tweets`.`id` = 20

    def destroy
        Tweet.find(params[:id]).destroy
---
DELETE FROM `tweets` WHERE `tweets`.`id` = 7
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1

    def create
       @tweet = Tweet.new(tweet_params)

       @tweet.user_id = current_user.id

       if @tweet.save
---
INSERT INTO `tweets` (`created_at`, `updated_at`, `user_id`, `image`, `body`) VALUES ('2020-09-09 10:30:28.834778', '2020-09-09 10:30:28.834778', 1, '70007021213016110100300.jpg', '34rt')

    def show
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1