app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`tweet_id` = 6 LIMIT 1
---
         def already_liked?(tweet)
          self.likes.exists?(tweet_id: tweet.id)

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'masakiyousuke@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
---
        def self.from_omniauth(access_token)
          data = access_token.info
          user = User.where(email: data['email']).first